#+TITLE: Annotation
#+PROPERTY:  header-args :var DIR=(file-name-directory buffer-file-name)



* Hisat

#+BEGIN_SRC sh :var genomes=genomes :tangle 1-hisat/db/make.sh
cd $DIR
ROOT=$(git rev-parse --show-toplevel)

PATH=$DIR/apps/hisat2-2.1.0/:$PATH

for name in "${!genomes[@]}"; do
    hisat2-build $ROOT/${genomes[$name]} $DIR/1-hisat/db/$name
done
#+END_SRC

#+HEADER: :prologue #PBS -lwalltime=24:00:00 -t 0-32
#+BEGIN_SRC sh :var libs=libs :tangle 1-hisat/run.sh
cd $DIR
ROOT=$(git rev-parse --show-toplevel)

NAMES=(${!libs[@]})
acc=${NAMES[$SLURM_ARRAY_TASK_ID]}

readarray -t lib <<<"${libs[$acc]}"

PATH=$DIR/apps/hisat2-2.1.0/:$PATH
PATH=/apps/contrib/maa146/samtools-v1.10/bin/:$PATH

mkdir -p $DIR/1-hisat/$genome

if [ -z ${lib[1]} ]; then
    hisat2 -p $SLURM_CPUS_ON_NODE \
           -x $DIR/1-hisat/db/${genome} \
           -U $DIR/0-ref/RNA-seq/${lib[0]} \
           2>$DIR/1-hisat/$genome/$acc.stats  |
        samtools view -bS - > $DIR/1-hisat/$genome/$acc.bam
else
    hisat2 -p $SLURM_CPUS_ON_NODE  \
           -x $DIR/1-hisat/db/${genome} \
           -1 $DIR/0-ref/RNA-seq/${lib[0]} \
           -2 $DIR/0-ref/RNA-seq/${lib[1]} \
           2>$DIR/1-hisat/$genome/$acc.stats |
        samtools view -bS - > $DIR/1-hisat/$genome/$acc.bam
fi

#+END_SRC

#+BEGIN_SRC sh :results output drawer
cat << EOF
| Genome | Library    | Align Rate |
|--------+------------+------------|
EOF

grep overall $DIR/1-hisat/*/*.stats | sed "s#$DIR/1-hisat/##" |
    awk '{sub(".stats", "", $2); print "", $1, $2, $3, ""}' FS="[/: ]" OFS="|"
#+END_SRC
#+RESULTS:
:results:
#+NAME: alignments
| Genome | Library     | Align Rate |
|--------+-------------+------------|
| E      | SRR8267606  |     77.25% |
| E      | SRR10675237 |     77.22% |
| E      | SRR10675236 |     75.72% |
| E      | SRR10675235 |     75.10% |
| E      | SRR8878800  |     74.69% |
| E      | SRR8267554  |     74.08% |
| E      | SRR6327759  |     73.83% |
| E      | SRR8878661  |     73.83% |
| E      | SRR8267616  |     73.31% |
| E      | SRR8267582  |     73.26% |
| E      | SRR8878565  |     72.77% |
| E      | SRR8267623  |     72.18% |
| E      | SRR8267601  |     70.95% |
| E      | SRR8267566  |     70.91% |
| E      | SRR8267619  |     70.84% |
| E      | SRR8878745  |     70.09% |
| E      | SRR6327758  |     70.00% |

| E      | SRR8878534  |     69.55% |
| E      | SRR8878526  |     69.52% |
| E      | SRR6327757  |     68.90% |
| E      | SRR2132267  |     66.04% |
| E      | SRR959585   |     64.30% |
| E      | SRR617073   |     51.61% |
| E      | SRR617011   |     51.17% |
| E      | SRR617075   |     50.78% |
| E      | SRR959508   |     50.42% |
| E      | SRR10675234 |     50.26% |
| E      | SRR617009   |     49.34% |
| E      | SRR617013   |     49.10% |
| E      | SRR617068   |     47.94% |
| E      | SRR617067   |     38.82% |
| E      | SRR1174179  |     36.16% |
| E      | SRR1174182  |      0.00% |
:end:

#+BEGIN_SRC sh :var libs=alignments[,1] :var genomes=genomes[,0] :tangle 1-hisat/merge.sh
cd $DIR
ml igbb samtools

PATH=/apps/contrib/maa146/samtools-v1.10/bin/:$PATH

for lib in "${libs[@]}"; do
     samtools sort -m60G \
         -T $DIR/1-hisat/$genome/$lib.tmp \
         -o $DIR/1-hisat/$genome/$lib.sort.bam \
         $DIR/1-hisat/$genome/$lib.bam
done


samtools merge $DIR/1-hisat/$genome/merged.bam \
    $(printf " $DIR/1-hisat/$genome/%s.sort.bam" "${libs[@]}")
samtools index $DIR/1-hisat/$genome/merged.bam

#+END_SRC


